#+todo: TODO | DONE

***** Searching
:PROPERTIES:
:ID:       1A851198-298A-417B-9E16-091C0F722A69
:header-args:sql: :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
:END:

#+begin_src sql
\d+ station
#+end_src

#+RESULTS:
| Table "public.station"                  |                  |           |          |         |          |             |              |             |
|-----------------------------------------+------------------+-----------+----------+---------+----------+-------------+--------------+-------------|
| Column                                  | Type             | Collation | Nullable | Default | Storage  | Compression | Stats target | Description |
| fid                                     | integer          |           | not null |         | plain    |             |              |             |
| id                                      | text             |           |          |         | extended |             |              |             |
| finnish_name                            | text             |           |          |         | extended |             |              |             |
| swedish_name                            | text             |           |          |         | extended |             |              |             |
| english_name                            | text             |           |          |         | extended |             |              |             |
| finnish_address                         | text             |           |          |         | extended |             |              |             |
| swedish_address                         | text             |           |          |         | extended |             |              |             |
| finnish_city                            | text             |           |          |         | extended |             |              |             |
| swedish_city                            | text             |           |          |         | extended |             |              |             |
| operator                                | text             |           |          |         | extended |             |              |             |
| capacity                                | integer          |           |          |         | plain    |             |              |             |
| x                                       | double precision |           |          |         | plain    |             |              |             |
| y                                       | double precision |           |          |         | plain    |             |              |             |
| Indexes:                                |                  |           |          |         |          |             |              |             |
| "station_pkey" PRIMARY KEY, btree (fid) |                  |           |          |         |          |             |              |             |
| Access method: heap                     |                  |           |          |         |          |             |              |             |

#+begin_src sql
SELECT english_name, finnish_address
FROM station
WHERE    english_name    ILIKE '%kannel%'
      OR finnish_address ILIKE '%kannel%'
LIMIT 10;
#+end_src

#+RESULTS:
| english_name               | finnish_address |
|----------------------------+-----------------|
| Kannelmäen liikuntapuisto  | Kanneltie 12    |
| Kannelmäki railway station | Sitratori 2     |


** Get acquainted with the project assignment
:LOGBOOK:
CLOCK: [2023-04-01 Sat 20:10]--[2023-04-01 Sat 20:40] =>  0:30
:END:

** Collect requirements
:LOGBOOK:
CLOCK: [2023-04-02 Sun 09:04]--[2023-04-02 Sun 09:37] =>  0:33
CLOCK: [2023-04-01 Sat 20:41]--[2023-04-01 Sat 21:14] =>  0:33
:END:

** Explore the dataset
:PROPERTIES:
:header-args: :noweb yes
:ID:       8FAC00D2-5DBC-4127-B7F6-EE8244DEAF7A
:END:
:LOGBOOK:
CLOCK: [2023-04-07 Fri 20:40]--[2023-04-07 Fri 21:00] =>  0:20
CLOCK: [2023-04-07 Fri 19:44]--[2023-04-07 Fri 19:46] =>  0:02
CLOCK: [2023-04-07 Fri 15:58]--[2023-04-07 Fri 18:51] =>  1:38
CLOCK: [2023-04-02 Sun 09:38]--[2023-04-02 Sun 10:05] =>  0:27
CLOCK: [2023-04-01 Sat 22:51]--[2023-04-01 Sat 23:46] =>  0:55
CLOCK: [2023-04-01 Sat 22:29]--[2023-04-01 Sat 22:38] =>  0:09
CLOCK: [2023-04-01 Sat 21:15]--[2023-04-01 Sat 22:17] =>  1:02
:END:

*** Journeys CSVs
:LOGBOOK:
CLOCK: [2023-04-08 Sat 21:39]--[2023-04-08 Sat 22:36] =>  0:57
CLOCK: [2023-04-08 Sat 00:58]--[2023-04-08 Sat 01:05] =>  0:07
:END:
The journey dataset consists of three files, one file for the data of one month.

CSV header defines the following fields:
+ Departure
+ Return
+ Departure station id
+ Departure station name
+ Return station id
+ Return station name
+ Covered distance (m)
+ Duration (sec)

AKA this thing:

#+name: JourneyRecordTuple
#+begin_src python
from collections import namedtuple

JourneyRecord = namedtuple(
    'JourneyRecord',
    'departure_time,return_time,departure_id,departure_name,return_id,return_name,distance,duration'
)
#+end_src

#+header: :cache yes
#+header: :dir ../dataset/
#+begin_src python
import csv

f = '2021-05.csv'

<<JourneyRecordTuple>>

reader = csv.reader(open(f, 'r'))
# skip the header
next(reader)
print(list(map(JourneyRecord._make, reader))[1:2])
#+end_src

#+RESULTS[2684a09d41a676953da92f9c5450e4deecae00a0]:
: [JourneyRecord(departure_time='2021-05-31T23:56:59', return_time='2021-06-01T00:07:14', departure_id='082', departure_name='Töölöntulli', return_id='113', return_name='Pasilan asema', distance='1870', duration='611')]

Departure seems to be a timestamp without a timezone, same for Return.  I'll just assume this is in UTC and move on.

Departure station id and return station id seem to strings, because they may start with a 0.  +Distance and duration are ints+.  Only duration is always an int, distance may be the empty string, or a float.  Let's set the distance to 0 if it is represented as an empty string.  Departure and return stations names seem to be simple strings.

Here's a parser to check if I'm right.

#+name: JourneyParser
#+begin_src python
<<JourneyRecordTuple>>

from datetime import datetime


class Journey:
    def __init__(
            self,
            departure_time,
            return_time,
            departure_station_id,
            departure_station_name,
            return_station_id,
            return_station_name,
            distance,
            duration
    ):
        self.departure_time = departure_time
        self.return_time = return_time
        self.departure_station_id = departure_station_id
        self.departure_station_name = departure_station_name
        self.return_station_id = return_station_id
        self.return_station_name = return_station_name
        self.distance = distance
        self.duration = duration


    def from_journey_record(record):
        return Journey(
            record.departure_time,
            record.return_time,
            record.departure_id,
            record.departure_name,
            record.return_id,
            record.return_name,
            record.distance,
            record.duration
        )

    @property
    def duration(self):
        return self._duration

    @duration.setter
    def duration(self, duration):
        if isinstance(duration, str):
            duration = int(duration)
        if not isinstance(duration, int):
            raise ValueError('???')
        self._duration = duration

    @property
    def distance(self):
        return self._distance

    @distance.setter
    def distance(self, distance):
        if isinstance(distance, str):
            if distance == '':
                distance = 0.0
            else:
                distance = float(distance)
        if not isinstance(distance, float):
            raise ValueError('???')
        self._distance = distance

    @property
    def return_station_name(self):
        return self._return_station_name

    @return_station_name.setter
    def return_station_name(self, return_station_name):
        if not isinstance(return_station_name, str):
            raise ValueError('???')
        self._return_station_name = return_station_name

    @property
    def return_station_id(self):
        return self._return_station_id

    @return_station_id.setter
    def return_station_id(self, return_station_id):
        if not isinstance(return_station_id, str):
            raise ValueError('???')
        self._return_station_id = return_station_id

    @property
    def departure_station_name(self):
        return self._departure_station_name

    @departure_station_name.setter
    def departure_station_name(self, departure_station_name):
        if not isinstance(departure_station_name, str):
            raise ValueError('???')
        self._departure_station_name = departure_station_name

    @property
    def departure_station_id(self):
        return self._departure_station_id

    @departure_station_id.setter
    def departure_station_id(self, departure_station_id):
        if not isinstance(departure_station_id, str):
            raise ValueError('???')
        self._departure_station_id = departure_station_id

    @property
    def return_time(self):
        return self._return_time

    @return_time.setter
    def return_time(self, return_time):
        if isinstance(return_time, str):
            return_time = datetime.fromisoformat(return_time)
        if not isinstance(return_time, datetime):
            raise ValueError('???')
        self._return_time = return_time

    @property
    def departure_time(self):
        return self._departure_time

    @departure_time.setter
    def departure_time(self, departure_time):
        if isinstance(departure_time, str):
            departure_time = datetime.fromisoformat(departure_time)
        if not isinstance(departure_time, datetime):
            raise ValueError('???')
        self._departure_time = departure_time

    def __repr__(self):
        return (
            'Journey('
            f'{str(self.departure_time)!r}, '
            f'{str(self.return_time)!r}, '
            f'{self.departure_station_id!r}, '
            f'{self.departure_station_name!r}, '
            f'{self.return_station_id!r}, '
            f'{self.return_station_name!r}, '
            f'{self.distance!r}, '
            f'{self.duration!r}'
            ')'
        )
#+end_src

We can check with the parser if all the data is now parseable.

#+header: :cache yes
#+header: :dir ../dataset/
#+begin_src python
import csv
import traceback

files = ['2021-05.csv', '2021-06.csv', '2021-07.csv']

<<JourneyParser>>

def try_parse(journey_record):
    try:
        return Journey.from_journey_record(journey_record)
    except Exception as e:
        print(traceback.format_exc(), end='')
        raise e

for f in files:
    reader = csv.reader(open(f, 'r', newline=''))
    # skip the header
    next(reader)
    list(map(try_parse, map(JourneyRecord._make, reader)))
#+end_src

#+RESULTS[6b314abaa957fbe31922465789c4ad91639619ee]:

Since this results in no output, we have a good enough parser for the data.

We can dump the data into an sqlite3 database.

#+header: :cache yes
#+header: :dir ../dataset/
#+begin_src python
import sqlite3

con = sqlite3.connect("journey.db")
cur = con.cursor()
query = """
CREATE TABLE IF NOT EXISTS journey(
  departure_time,
  return_time,
  departure_station_id,
  departure_station_name,
  return_station_id,
  return_station_name,
  distance,
  duration
)
"""
cur.execute(query)
tables = cur.execute("SELECT name from sqlite_master")

<<JourneyParser>>

import csv

files = ['2021-05.csv', '2021-06.csv', '2021-07.csv']
for f in files:
    reader = csv.reader(open(f, 'r', newline=''))
    # skip the header
    next(reader)
    for journey in map(
            Journey.from_journey_record,
            (map(JourneyRecord._make, reader))):
        cur.execute(
            "INSERT INTO journey VALUES(?, ?, ?, ?, ?, ?, ? ,?)",
            (journey.departure_time,
             journey.return_time,
             journey.departure_station_id,
             journey.departure_station_name,
             journey.return_station_id,
             journey.return_station_name,
             journey.distance,
             journey.duration)
        )
con.commit()
con.close()
#+end_src

#+RESULTS[a754e722ce2e73a672bfd92b059904ac186de661]:

And then look up stuff I guess.

#+header: :dir ../dataset
#+begin_src python
import sqlite3

con = sqlite3.connect("journey.db")
query = "SELECT * FROM journey LIMIT 1"
res=con.execute(query)
print(res.fetchone())
con.close()
#+end_src

#+RESULTS:
: ('2021-05-31 23:57:25', '2021-06-01 00:05:46', '094', 'Laajalahden aukio', '100', 'Teljäntie', 2043.0, 500)

And then push to a psql server

#+begin_src sh
podman network create postgres
podman run --rm -d \
       --name postgres-server \
       --network=postgres \
       -p5432:5432 \
       -e POSTGRES_PASSWORD=postgres \
       postgres
#+end_src

#+header: :tangle ../dataset/export-to-psql-requirements.txt
#+begin_src text
psycopg2-binary
#+end_src

#+header: :tangle ../dataset/export-to-psql.py
#+begin_src python
import psycopg2
import os


conn = psycopg2.connect(
    database=os.environ['PSQL_POSTGRES_DB'],
    user=os.environ['PSQL_USER'],
    password=os.environ['PSQL_PASS'],
    host=os.environ['PSQL_HOST'],
    port=os.environ['PSQL_PORT']
)

conn.autocommit = True

from psycopg2.errors import DuplicateDatabase

try:
    with conn.cursor() as cur:
        cur.execute("CREATE DATABASE hcb")
except DuplicateDatabase:
    pass
finally:
    conn.close()

conn = psycopg2.connect(
    database='hcb',
    user=os.environ['PSQL_USER'],
    password=os.environ['PSQL_PASS'],
    host=os.environ['PSQL_HOST'],
    port=os.environ['PSQL_PORT']
)
conn.autocommit = False

SQL = """
CREATE TABLE IF NOT EXISTS journey (
departure_time TIMESTAMP,
return_time TIMESTAMP,
departure_station_id TEXT,
departure_station_name TEXT,
return_station_id TEXT,
return_station_name TEXT,
distance FLOAT,
duration INTEGER
)
"""

cur = conn.cursor()
cur.execute(SQL)
SQL = "INSERT INTO journey VALUES(%s, %s, %s, %s, %s, %s, %s, %s)"

import sqlite3

scon = sqlite3.connect("journey.db")
query = "SELECT * FROM journey"
res=scon.execute(query)

<<JourneyParser>>

for i, journey in enumerate(map(Journey.from_journey_record, map(JourneyRecord._make, res.fetchall()))):
    cur.execute(
        SQL,
        (
            journey.departure_time,
            journey.return_time,
            journey.departure_station_id,
            journey.departure_station_name,
            journey.return_station_id,
            journey.return_station_name,
            journey.distance,
            journey.duration
        )
    )
    if i % 1000 == 0:
        print(i)

conn.commit()
scon.close()
conn.close()
#+end_src

Need an index if I want to implement stable sorting.

#+begin_src sql
ALTER TABLE journey
ADD COLUMN id SERIAL PRIMARY KEY;
#+end_src

And some indexes to speed up querying

#+begin_src sql :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
CREATE INDEX distance_index
ON journey(distance);
#+end_src

#+RESULTS:
| CREATE INDEX |
|--------------|

#+begin_src sql :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
CREATE INDEX duration_index
ON journey(duration);
#+end_src

#+RESULTS:
| CREATE INDEX |
|--------------|

#+begin_src sql :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
CREATE INDEX departure_station_index
ON journey(departure_station_name);
#+end_src

#+RESULTS:
| CREATE INDEX |
|--------------|

#+begin_src sql :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
CREATE INDEX return_station_index
ON journey(return_station_name);
#+end_src

#+RESULTS:
| CREATE INDEX |
|--------------|

How do I get this bad boy to Google SQL cheaply?

Almost all lines in the original csv's contain dups.

Here's a script that merges the files into one and deletes all dups.

#+header: :dir ../dataset
#+begin_src bash
cat <(tail +2 2021-05.csv) \
    <(tail +2 2021-06.csv) \
    <(tail +2 2021-07.csv) \
    | sort | uniq > journeys.csv
#+end_src

#+header: :dir ../dataset
#+begin_src sh
wc -l 2021-0?.csv journeys.csv
#+end_src

#+RESULTS:
|  814677 | 2021-05.csv  |
| 1223483 | 2021-06.csv  |
| 1208845 | 2021-07.csv  |
| 1623501 | journeys.csv |
| 4870506 | total        |

*** We want statistics
:PROPERTIES:
:header-args:sql: :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
:END:

#+begin_src sql
WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = 1
)
SELECT COUNT(*) AS departures
FROM journey
JOIN our_station
ON journey.departure_station_id = our_station.id;
#+end_src

#+RESULTS:
| departures |
|------------|
|       4930 |

#+begin_src sql
SELECT COUNT(*) from journey
WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7);
#+end_src

#+RESULTS:
|   count |
|---------|
| 3247002 |

#+begin_src sql
WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = 1
)
SELECT COUNT(*) AS returns
FROM journey
JOIN our_station
ON journey.return_station_id = our_station.id;
#+end_src

#+RESULTS:
| returns |
|---------|
|    5072 |

#+begin_src sql
WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = 1
)
SELECT AVG(distance) as average_journey
FROM journey
JOIN our_station
ON journey.departure_station_id = our_station.id;
#+end_src

#+RESULTS:
|   average_journey |
|-------------------|
| 3655.007302231237 |

#+begin_src sql
WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = 1
)
SELECT AVG(distance) as average_journey
FROM journey
JOIN our_station
ON journey.return_station_id = our_station.id;
#+end_src

#+RESULTS:
|    average_journey |
|--------------------|
| 3773.3036277602523 |

#+begin_src sql
WITH station AS (
    SELECT *
    FROM station
    WHERE fid = 1
),
statistics AS (
    SELECT (
        SELECT id FROM station
    ), (
        SELECT AVG(distance) as average_departure_distance
        FROM journey
        JOIN station
        ON station.id = departure_station_id
        WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
    ) as avg_departure_distance,
    (
        SELECT AVG(distance) as average_return_distance
        FROM journey
        JOIN station
        ON station.id = return_station_id
        WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
    ) as avg_return_distance
)
SELECT avg_return_distance, avg_departure_distance
FROM station
JOIN statistics
ON station.id = statistics.id;
#+end_src

#+RESULTS:
| avg_return_distance | avg_departure_distance |
|---------------------+------------------------|
|  3773.3036277602523 |      3655.007302231237 |

#+begin_src sql
WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = 1
)
SELECT return_station_id, return_station_name, COUNT(return_station_id)
FROM journey
JOIN our_station
ON journey.departure_station_id = our_station.id
WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
GROUP BY return_station_name, journey.return_station_id
ORDER BY count DESC
LIMIT 5;
#+end_src

#+RESULTS:
| return_station_id | return_station_name      | count |
|-------------------+--------------------------+-------|
|               401 | Koivusaari (M)           |   376 |
|               501 | Hanasaari                |   292 |
|               057 | Lauttasaaren ostoskeskus |   246 |
|               055 | Puistokaari              |   224 |
|               505 | Westendinasema           |   222 |

#+begin_src sql
\set fid 1

WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = :fid
)
SELECT departure_station_id, departure_station_name, COUNT(*)
FROM journey
JOIN our_station
ON return_station_id = our_station.id
WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
GROUP BY departure_station_name, departure_station_id
ORDER BY count DESC
LIMIT 5;
#+end_src

#+RESULTS:
| departure_station_id | departure_station_name   | count |
|----------------------+--------------------------+-------|
|                  401 | Koivusaari (M)           |   200 |
|                  055 | Puistokaari              |   121 |
|                  595 | Westendintie             |   105 |
|                  030 | Itämerentori             |    93 |
|                  057 | Lauttasaaren ostoskeskus |    81 |

#+begin_src sql
WITH station AS (
    SELECT *
    FROM station
    WHERE fid = 1
),
statistics AS (
    SELECT (
        SELECT id FROM station
    ), (
        SELECT COUNT(*)
        FROM journey
        JOIN station
        ON station.id = departure_station_id
        WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
    ) as departures,
    ( SELECT COUNT(*)
        FROM journey
        JOIN station
        ON station.id = return_station_id
        WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
    ) as returns
)
SELECT returns, departures
FROM station
JOIN statistics
ON station.id = statistics.id;
#+end_src

#+RESULTS:
| returns | departures |
|---------+------------|
|    1410 |       4930 |

*** A random station
:PROPERTIES:
:header-args:sql: :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
:END:

#+begin_src sql
SELECT fid from station
ORDER BY RANDOM()
LIMIT 1;
#+end_src

#+RESULTS:
| fid |
|-----|
| 344 |

*** Top 5 destinations
:PROPERTIES:
:header-args:sql: :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
:END:

#+begin_src sql
WITH our_station AS (
     SELECT id
     FROM station
     WHERE fid = 320
),
top_destinations AS (
     SELECT return_station_id, COUNT(*)
     FROM journey
     JOIN our_station
     ON journey.departure_station_id = our_station.id
     WHERE EXTRACT(MONTH FROM departure_time) IN (5, 6, 7)
     GROUP BY return_station_id
     ORDER BY count DESC
     LIMIT 5
)
SELECT station.fid as id, station.finnish_name, count
FROM top_destinations
JOIN station
ON station.id = top_destinations.return_station_id
ORDER BY count DESC;

-- SELECT return_station

-- WITH our_station AS (
--      SELECT id
--      FROM station
--      WHERE fid = 320
-- )
-- SELECT return_station_id, return_station_name, COUNT(return_station_id)
-- FROM journey
-- JOIN our_station
-- ON journey.departure_station_id = our_station.id
-- WHERE EXTRACT(MONTH FROM departure_time) IN (5,6,7)
-- GROUP BY return_station_name, journey.return_station_id
-- ORDER BY count DESC
-- LIMIT 5;
#+end_src

#+RESULTS:
|  id | finnish_name         | count |
|-----+----------------------+-------|
| 322 | Herttoniemi (M)      |   378 |
| 321 | Petter Wetterin tie  |   200 |
| 320 | Abraham Wetterin tie |   165 |
| 330 | Porolahden koulu     |   161 |
| 332 | Tulisuontie          |    86 |

*** Station CSV
:LOGBOOK:
CLOCK: [2023-04-08 Sat 00:15]--[2023-04-08 Sat 00:58] =>  0:43
:END:

Here's a parser for the station CSV.

#+name: StationTypes
#+begin_src python
from collections import namedtuple

StationRecord = namedtuple(
    'StationRecord',
    'fid,id,finnish_name,swedish_name,english_name,finnish_address,swedish_address,finnish_city,swedish_city,operator,capacity,x,y')

class Station:
    def __init__(
            self,
            fid,
            id,
            finnish_name,
            swedish_name,
            english_name,
            finnish_address,
            swedish_address,
            finnish_city,
            swedish_city,
            operator,
            capacity,
            x,
            y
    ):
        self.fid = fid
        self.id = id
        self.finnish_name = finnish_name
        self.swedish_name = swedish_name
        self.english_name = english_name
        self.finnish_address = finnish_address
        self.swedish_address = swedish_address
        self.finnish_city = finnish_city
        self.swedish_city = swedish_city
        self.operator = operator
        self.capacity = capacity
        self.x = x
        self.y = y

    @staticmethod
    def from_station_record(record):
        return Station(
            record.fid,
            record.id,
            record.finnish_name,
            record.swedish_name,
            record.english_name,
            record.finnish_address,
            record.swedish_address,
            record.finnish_city,
            record.swedish_city,
            record.operator,
            record.capacity,
            record.x,
            record.y
        )

    def __repr__(self):
        return (
            'Station('
            f'{str(self.fid)!r}, '
            f'{self.id!r}, '
            f'{self.finnish_name!r}, '
            f'{self.swedish_name!r}, '
            f'{self.english_name!r}, '
            f'{self.finnish_address!r}, '
            f'{self.swedish_address!r}, '
            f'{self.finnish_city!r},'
            f'{self.swedish_city!r},'
            f'{self.operator!r},'
            f'{str(self.capacity)!r},'
            f'{str(self.x)!r},'
            f'{str(self.y)!r}'
            ')'
        )

    @property
    def y(self):
        return self._y

    @y.setter
    def y(self, y):
        if isinstance(y, str):
            y = float(y)

        if not isinstance(y, float):
            raise ValueError()
        self._y = y

    @property
    def x(self):
        return self._x

    @x.setter
    def x(self, x):
        if isinstance(x, str):
            x = float(x)

        if not isinstance(x, float):
            raise ValueError()
        self._x = x

    @property
    def capacity(self):
        return self._capacity

    @capacity.setter
    def capacity(self, capacity):
        if isinstance(capacity, str):
            capacity = int(capacity)

        if not isinstance(capacity, int):
            raise ValueError()
        self._capacity = capacity

    @property
    def operator(self):
        return self._operator

    @operator.setter
    def operator(self, operator):
        if not isinstance(operator, str):
            raise ValueError()
        self._operator = operator

    @property
    def swedish_address(self):
        return self._swedish_address

    @swedish_address.setter
    def swedish_address(self, swedish_address):
        if not isinstance(swedish_address, str):
            raise ValueError()
        self._swedish_address = swedish_address

    @property
    def finnish_address(self):
        return self._finnish_address

    @finnish_address.setter
    def finnish_address(self, finnish_address):
        if not isinstance(finnish_address, str):
            raise ValueError()
        self._finnish_address = finnish_address

    @property
    def english_name(self):
        return self._english_name

    @english_name.setter
    def english_name(self, english_name):
        if not isinstance(english_name, str):
            raise ValueError()
        self._english_name = english_name

    @property
    def swedish_name(self):
        return self._swedish_name

    @swedish_name.setter
    def swedish_name(self, swedish_name):
        if not isinstance(swedish_name, str):
            raise ValueError()
        self._swedish_name = swedish_name

    @property
    def finnish_name(self):
        return self._finnish_name

    @finnish_name.setter
    def finnish_name(self, finnish_name):
        if not isinstance(finnish_name, str):
            raise ValueError()
        self._finnish_name = finnish_name

    @property
    def id(self):
        return self._id

    @id.setter
    def id(self, id):
        if not isinstance(id, str):
            raise ValueError()
        self._id = id

    @property
    def fid(self):
        return self._fid

    @fid.setter
    def fid(self, fid):
        if isinstance(fid, str):
            fid = int(fid)
        if not isinstance(fid, int):
            raise ValueError()
        self._fid = fid
#+end_src

#+RESULTS: StationTypes


Here's how I pushed the stuff into psql.

#+header: :tangle ../dataset/station-to-sql-requirements.txt
#+begin_src text
psycopg2-binary
#+end_src

#+header: :tangle ../dataset/station-to-sql.py
#+header: :dir ../dataset/
#+begin_src python
import csv
import pprint
import traceback
import psycopg2
import os
<<StationTypes>>

file = 'asemat.csv'

reader = csv.reader(open(file, 'r', newline=''))
# skip header
next(reader)
stations = map(Station.from_station_record, map(StationRecord._make, reader))


conn = psycopg2.connect(
    database='hcb',
    user=os.environ['PSQL_USER'],
    password=os.environ['PSQL_PASS'],
    host=os.environ['PSQL_HOST'],
    port=os.environ['PSQL_PORT']
)

SQL = """
CREATE TABLE IF NOT EXISTS station (
  fid INTEGER PRIMARY KEY,
  id TEXT,
  finnish_name TEXT,
  swedish_name TEXT,
  english_name TEXT,
  finnish_address TEXT,
  swedish_address TEXT,
  finnish_city TEXT,
  swedish_city TEXT,
  operator TEXT,
  capacity INTEGER,
  x FLOAT,
  y FLOAT
)
"""

cur = conn.cursor()
cur.execute(SQL)

SQL = "INSERT INTO station VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"

for station in stations:
    cur.execute(SQL, (
        station.fid,
        station.id,
        station.finnish_name,
        station.swedish_name,
        station.english_name,
        station.finnish_address,
        station.swedish_address,
        station.finnish_city,
        station.swedish_city,
        station.operator,
        station.capacity,
        station.x,
        station.y
    ))

conn.commit()
conn.close()
#+end_src

#+RESULTS:

** Write the frontend
:LOGBOOK:
CLOCK: [2023-04-09 Sun 14:49]--[2023-04-09 Sun 18:36] =>  3:47
CLOCK: [2023-04-08 Sat 23:02]--[2023-04-09 Sun 00:44] =>  1:42
CLOCK: [2023-04-08 Sat 22:36]--[2023-04-08 Sat 23:02] =>  0:26
CLOCK: [2023-04-08 Sat 21:28]--[2023-04-08 Sat 21:39] =>  0:11
CLOCK: [2023-04-08 Sat 11:29]--[2023-04-08 Sat 15:59] =>  4:30
CLOCK: [2023-04-08 Sat 01:06]--[2023-04-08 Sat 01:30] =>  0:24
CLOCK: [2023-04-07 Fri 20:04]--[2023-04-07 Fri 20:29] =>  0:25
CLOCK: [2023-04-07 Fri 15:29]--[2023-04-07 Fri 15:40] =>  0:11
CLOCK: [2023-04-07 Fri 14:29]--[2023-04-07 Fri 15:15] =>  0:46
CLOCK: [2023-04-06 Thu 12:20]--[2023-04-06 Thu 13:18] =>  0:58
CLOCK: [2023-04-06 Thu 10:56]--[2023-04-06 Thu 11:23] =>  0:27
CLOCK: [2023-04-02 Sun 10:22]--[2023-04-02 Sun 12:10] =>  1:48
:END:

Now that we have an sqlite database of the journey data, we can start implementing its view.  The “backend” used is going to be the sqlite database.

Spent the first 45 minutes fighting with setuptools because the directory I had the package in contained a space, great success.

Created project starter with command [[shell:cookiecutter gh:Pylons/pyramid-cookiecutter-starter]].  Project is in directory [[file:hcbf/]].

Journeys list view now exists, it fetches data straight from an sqlite database.  Implements pagination and the recommended fields.

Converted the frontend from pyramid to flask.

Added support for pgsql data source.

Implemented the stations view.

Added pagination to stations view.

Implemented filtering by month in single station view.

** Write data import
:LOGBOOK:
CLOCK: [2023-04-09 Sun 23:12]--[2023-04-10 Mon 01:01] =>  1:49
CLOCK: [2023-04-09 Sun 19:13]--[2023-04-09 Sun 23:13] =>  4:00
:END:

** Refactor into frontend & backend
:LOGBOOK:
CLOCK: [2023-04-10 Mon 23:22]--[2023-04-11 Tue 00:34] =>  1:12
CLOCK: [2023-04-10 Mon 21:00]--[2023-04-10 Mon 23:00] =>  2:00
CLOCK: [2023-04-10 Mon 16:45]--[2023-04-10 Mon 20:27] =>  3:42
:END:


Currenly “the app” consists of a single server and an SQL database

The server:
+ Accepts HTTP requests from end users
+ Fetches data from the database with prepared SQL statements
+ Renders data into HTML pages
+ Responds to the end user’s request

One of the requirements outlined in the exercise is to have a [[id:9916A29B-46A5-4BC2-94E3-F9165C036275][separate backend service]] for querying data.  Currently that service is a SQL database instance.  To match the exercise criteria, I need to create a facade service to the database instance.  The facade should follow the [[https://www.ics.uci.edu/~fielding/pubs/dissertation/rest_arch_style.htm][REST architectural style]].

Moved “the frontend” to to use “the backend” when rendering =/journeys=.

** Mock up journeys list view
:LOGBOOK:
CLOCK: [2023-04-06 Thu 12:09]--[2023-04-06 Thu 12:19] =>  0:10
CLOCK: [2023-04-06 Thu 10:45]--[2023-04-06 Thu 10:54] =>  0:09
:END:

** Explore hosting options on google cloud
:LOGBOOK:
CLOCK: [2023-04-06 Thu 21:39]--[2023-04-06 Thu 22:23] =>  0:44
CLOCK: [2023-04-06 Thu 16:40]--[2023-04-06 Thu 17:46] =>  1:06
CLOCK: [2023-04-06 Thu 14:59]--[2023-04-06 Thu 15:45] =>  0:46
CLOCK: [2023-04-06 Thu 13:21]--[2023-04-06 Thu 13:41] =>  0:20
:END:

I was intending to host using cloud run, but seems app engine would be a nice option as well.  Example pulled from here [[https://cloud.google.com/appengine/docs/standard/python3/building-app/writing-web-service]].

#+header: :mkdirp yes :tangle app-engine/templates/index.html
#+begin_src jinja2
<!doctype html>
<html>
  <head>
    <title>Datastore and Firebase Auth Example</title>
    <script src="{{ url_for('static', filename='script.js') }}"></script>
    <link type="text/css" rel="stylesheet" href="{{ url_for('static', filename='style.css') }}">
  </head>
  <body>
    <h1>Datastore and Firebase Auth Example</h1>
    <h2>Last 10 visits</h2>
    {% for time in times %}
      <p>{{ time }}</p>
    {% endfor %}
  </body>
</html>
#+end_src

#+header: :mkdirp yes :tangle app-engine/static/script.js
#+begin_src js
'use strict';

window.addEventListener('load', function () {

  console.log("Hello World!");

});
#+end_src

#+header: :mkdirp yes :tangle app-engine/static/style.css
#+begin_src css
body {
  font-family: "helvetica", sans-serif;
  text-align: center;
}
#+end_src

#+header: :mkdirp yes :tangle app-engine/main.py
#+begin_src python
import datetime

from flask import Flask, render_template

app = Flask(__name__)


@app.route('/')
def root():
    # For the sake of example, use static information to inflate the
    # template.  This will be replaced with real information in later
    # steps.
    dummy_times = [
        datetime.datetime(2018, 1, 1, 10, 0, 0),
        datetime.datetime(2018, 1, 2, 10, 30, 0),
        datetime.datetime(2018, 1, 3, 11, 0, 0),
    ]

    return render_template('index.html', times=dummy_times)


if __name__ == '__main__':
    # This is used when running locally only. When deploying to Google
    # App Engine, a webserver process such as Gunicorn will serve the
    # app. This can be configured by adding an `entrypoint` to
    # app.yaml.  Flask's development server will automatically serve
    # static files in the "static" directory. See:
    # http://flask.pocoo.org/docs/1.0/quickstart/#static-files. Once
    # deployed, App Engine itself will serve those files as configured
    # in app.yaml.
    app.run(host='127.0.0.1', port=8080, debug=True)
#+end_src

#+header: :tangle app-engine/requirements.txt
#+begin_src text
Flask==2.1.0
#+end_src

#+header: :tangle app-engine/.gcloudignore
#+begin_src text
# This file specifies files that are *not* uploaded to Google Cloud
# using gcloud. It follows the same syntax as .gitignore, with the
# addition of "#!include" directives (which insert the entries of the
# given .gitignore-style file at that point).
#
# For more information, run:
#   $ gcloud topic gcloudignore
#
.gcloudignore
# If you would like to upload your .git directory, .gitignore file or files
# from your .gitignore file, remove the corresponding line
# below:
.git
.gitignore

# Python pycache:
__pycache__/
# Ignored by the build system
/setup.cfg
app-engine
#+end_src

app.yaml reference is here [[https://cloud.google.com/appengine/docs/standard/reference/app-yaml?tab=python]].

#+header: :tangle app-engine/app.yaml
#+begin_src yaml
runtime: python39

handlers:
  # This configures Google App Engine to serve the files in the app's
  # static directory.
- url: /static
  static_dir: static

  # This handler routes all requests not caught above to your main
  # app. It is required when static routes are defined, but can be
  # omitted (along with the entire handlers section) when there are no
  # static files defined.
- url: /.*
  script: auto
#+end_src

Here's an updated main.py that pushes and pulls data from datastore.

#+header: :tangle app-engine/main.py
#+begin_src python
from google.cloud import datastore
import datetime
from flask import Flask, render_template

datastore_client = datastore.Client()

def store_time(dt):
    entity = datastore.Entity(key=datastore_client.key('visit'))
    entity.update({
        'timestamp': dt
    })

    datastore_client.put(entity)


def fetch_times(limit):
    query = datastore_client.query(kind='visit')
    query.order = ['-timestamp']

    times = query.fetch(limit=limit)

    return times

app = Flask(__name__)

@app.route('/')
def root():
    # Store the current access time in Datastore.
    store_time(datetime.datetime.now(tz=datetime.timezone.utc))

    # Fetch the most recent 10 access times from Datastore.
    times = fetch_times(10)

    return render_template(
        'index.html', times=times)

if __name__ == '__main__':
    # This is used when running locally only. When deploying to Google
    # App Engine, a webserver process such as Gunicorn will serve the
    # app. This can be configured by adding an `entrypoint` to
    # app.yaml.  Flask's development server will automatically serve
    # static files in the "static" directory. See:
    # http://flask.pocoo.org/docs/1.0/quickstart/#static-files. Once
    # deployed, App Engine itself will serve those files as configured
    # in app.yaml.
    app.run(host='127.0.0.1', port=8080, debug=True)
#+end_src

And here's an updated index.html

#+header: :tangle app-engine/templates/index.html
#+begin_src jinja2
<!doctype html>
<html>
  <head>
    <title>Datastore and Firebase Auth Example</title>
    <script src="{{ url_for('static', filename='script.js') }}"></script>
    <link type="text/css" rel="stylesheet" href="{{ url_for('static', filename='style.css') }}">
  </head>
  <body>
    <h1>Datastore and Firebase Auth Example</h1>
    <h2>Last 10 visits</h2>
    {% for time in times %}
      <p>{{ time['timestamp'] }}</p>
    {% endfor %}
  </body>
</html>
#+end_src

#+header: :tangle app-engine/requirements.txt
#+begin_src text
Flask==2.1.0
google-cloud-datastore==2.7.1
#+end_src

Had to run the following to successfully connect to datastore:

#+begin_src sh
gcloud auth application-default login
GCLOUD_PROJECT=focal-disk-380217 ./app-engine/bin/python main.py
#+end_src

** Set up cloud SQL
:LOGBOOK:
CLOCK: [2023-04-07 Fri 14:12]--[2023-04-07 Fri 14:26] =>  0:14
:END:

** The database
:PROPERTIES:
:header-args:sql: :engine postgres :database hcb :dbuser postgres :dbpassword postgres :dbhost localhost :dbport 5432
:END:

Here's our database definition.  You can either execute these statements in an SQL prompt or use the ready-made python program provided at X.  Instructions for the python program are below.
# TODO add link to python program

#+header: :tangle hcbdb/create-database-hcb.sql :mkdirp yes
#+header: :database postgres
#+begin_src sql
CREATE DATABASE hcb;
#+end_src

#+RESULTS:
| CREATE DATABASE |
|-----------------|

#+name: create-table-journey
#+header: :tangle hcbdb/create-table-journey.sql :mkdirp yes
#+begin_src sql
BEGIN;

CREATE TABLE journey (
       id SERIAL PRIMARY KEY,
       departure_time TIMESTAMP,
       return_time TIMESTAMP,
       departure_station_id TEXT,
       departure_station_name TEXT,
       return_station_id TEXT,
       return_station_name TEXT,
       distance FLOAT,
       duration INTEGER
);

-- We need to sort on these columns
CREATE INDEX distance_index
ON journey(distance);

CREATE INDEX duration_index
ON journey(duration);

CREATE INDEX departure_station_name_index
ON journey(departure_station_name);

CREATE INDEX return_station_name_index
ON journey(return_station_name);

COMMIT;
#+end_src

#+RESULTS: create-table-journey
| BEGIN        |
|--------------|
| CREATE TABLE |
| CREATE INDEX |
| CREATE INDEX |
| CREATE INDEX |
| CREATE INDEX |
| COMMIT       |

#+name: create-table-station
#+header: :tangle hcbdb/create-table-station.sql :mkdirp yes
#+begin_src sql
CREATE TABLE  station (
       fid INTEGER PRIMARY KEY,
       id TEXT,
       finnish_name TEXT,
       swedish_name TEXT,
       english_name TEXT,
       finnish_address TEXT,
       swedish_address TEXT,
       finnish_city TEXT,
       swedish_city TEXT,
       operator TEXT,
       capacity INTEGER,
       x FLOAT,
       y FLOAT
)
#+end_src

#+RESULTS: create-table-station
| CREATE TABLE |
|--------------|

